In [45]:
import numpy as np
import pandas as pd

In [46]:
list1 = [[90, 60, 33], [50, 70, 75], [70, 90, 88], [80, 50, 60]]
columns = ['Math', 'English', 'History']
index = ['Simon','Allen','Jimmy','Peter']

In [47]:
df = pd.DataFrame(data=list1, columns=columns, index=index)

df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

取出數學>60 且英文>85 的資料, 並以DataFrame的方式呈現

In [48]:
df.query("Math>60 and English>85")

       Math  English  History
Jimmy    70       90       88

計算各科的平均數

In [49]:
df.mean

<bound method DataFrame.mean of        Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60>

依各科分數來個別排名

In [56]:
df.rank(ascending = False)

       Math  English  History
Simon   1.0      3.0      4.0
Allen   4.0      2.0      2.0
Jimmy   3.0      1.0      1.0
Peter   2.0      4.0      3.0

In [40]:
df ['Gender'] = ['M','F','M','M']
df

       Math  English  History Gender
Simon    90       60       33      M
Allen    50       70       75      F
Jimmy    70       90       88      M
Peter    80       50       60      M

性別的類別各出現幾次？

In [41]:
df['Gender'].value_counts()

M    3
F    1
Name: Gender, dtype: int64

算出每位同學的平均分數，再用平均分數排名

In [42]:
df ['AVG'] = (df ['Math'] + df ['English'] + df ['History']) / 3
df.sort_values('AVG', ascending = False)

       Math  English  History Gender        AVG
Jimmy    70       90       88      M  82.666667
Allen    50       70       75      F  65.000000
Peter    80       50       60      M  63.333333
Simon    90       60       33      M  61.000000